dataset_gen/CE-RP_openfoam/Design_Point_0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16384
(
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
(-0.12967536 -0.47270771 0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
